InformationRegisters/ОшибкиРасчетаПартийИСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиРасчетаПартийИСебестоимости</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПартийИСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОшибокПартионногоУчетаИСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыРасчетаПартийИСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаПартийИСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПартииИСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическаяСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяСебестоимостьРегламентноеЗадание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ОшибкиРасчетаПартийИСебестоимости/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив идентификаторов протоколов расчета указанных организаций.
//
// Параметры:
// 	ПериодРасчета - Дата - период расчета
// 	МассивОрганизаций - Массив - массив организаций
//
// Возвращаемое значение:
// 	Соответствие - идентификаторы протоколов
//
Функция ПолучитьПротоколыРасчета(ПериодРасчета, МассивОрганизаций) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВариантыРасчета = Новый Массив;
	
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ПериодРасчета)) Тогда
		ВариантыРасчета.Добавить(Перечисления.ВариантыРасчетаПартийИСебестоимости.ПартииИСебестоимость);
		ВариантыРасчета.Добавить(Перечисления.ВариантыРасчетаПартийИСебестоимости.ФактическаяСебестоимость);
	Иначе
		ВариантыРасчета.Добавить(Перечисления.ВариантыРасчетаПартийИСебестоимости.ФактическаяСебестоимость);
	КонецЕсли;
	
	ИдентификаторыПротоколов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ИдентификаторПротокола КАК ИдентификаторПротокола,
	|	Т.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОшибкиРасчетаПартийИСебестоимости КАК Т
	|ГДЕ
	|	Т.Период = &Период
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.ВариантРасчета В (&ВариантыРасчета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторПротокола,
	|	Организация
	|ИТОГИ ПО
	|	ИдентификаторПротокола";
	
	Запрос.УстановитьПараметр("Период", 		   НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("МассивОрганизаций", ОбщегоНазначенияУТКлиентСервер.Массив(МассивОрганизаций));
	Запрос.УстановитьПараметр("ВариантыРасчета",   ВариантыРасчета);
	
	ВыборкаИдентификаторов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИдентификаторов.Следующий() Цикл
		
		ОрганизацииПротокола = Новый Массив;
		Выборка = ВыборкаИдентификаторов.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОрганизацииПротокола.Добавить(Выборка.Организация);
		КонецЦикла;
		
		ИдентификаторыПротоколов.Вставить(ВыборкаИдентификаторов.ИдентификаторПротокола, ОрганизацииПротокола);
		
	КонецЦикла;
	
	Возврат ИдентификаторыПротоколов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
